# coding=UTF-8
'''刷新ncrm 组织架构 '''
import init_environ
import datetime
from apps.common.utils.utils_log import log
from apps.ncrm.models import PSUser, Customer, ClientGroup, Subscribe


DICT_DEPT = {
    'GROUP1': ['吴洋', '向宇', '邓雨晴', '熊钰馨', '张爽', '胡丽萍', '桂维维', '张道远', '袁江', '冀凌姣', '毛凌', '欧阳华宇', '郑慧敏'],
    'GROUP2': ['邱梦雪', '邱梦婷', '万明', '王玥', '王磊', '黄卓', '尚文蔚', '谢敏', '戈乐', '姚远', '曹敏', '鄢文豪'],
    'GROUP3': ['祝鹏', '杨益明', '王昆', '李有为', '周婉瑶', '朱少杰', '陈心怡', '杨若梅', '张聪', '王洋', '沈超', '李文杰'],
    'TGROUP1': ['夏甜', '李四芬', '侯小雷', '朱林海', '翟梦', '李若雪', '李冬', '张颖', '王青', '付玉花', '洪鹏', '李群'],
    'TGROUP2': ['姜宛英', '汪静', '王青云', '胡弯弯', '孙怡', '蒋雨娜', '王杰', '李雪琴', '薛尧', '周萍萍', '严娇', '陈晓云', '卢武'],
    'TGROUP3': ['朱静', '冯振南', '廖露', '刘俊', '孙丽', '董珊', '高云', '殷葵', '商程澄', '朱慧', '邱晓凤', '舒惠惠', '肖凯'],
    'TGROUP4': ['王艳花', '陈静', '魏星', '叶子凌', '明道远', '王萍', '毕佳男', '张文', '魏星', '舒容霞', '董涛', '贺丽明', '李迪佳'],
    'TGROUP5': ['董翠', '孙敏慧', '王林霞', '董越月', '万慧', '邓淑婉', '高可月', '潘婷', '陈绪东', '向卉', '何玉玲'],
    'TGROUP6': ['古哲浩', '魏熙', '何汝梦', '胡佳丽', '郭强', '马丽思', '张紫兰', '乐微', '郭俊良', '田傲', '高颖', '刘影', '刘彩霞'],
    'BRAND': ['王美云', '张汭', '蒋秋', '王秋石', '胡谦', '吴诗龙', '胡瑜', '杨芳', '叶星', '胡慧', '宋青', '樊东虎', '李养旭', '刘千雨', '刘颖', '王栋'],
    'DESIGN': ['吕雅雅', '王亚琴', '邵蓓', '王玲', '秦娇', '李秋丽', '陈忠', '许晓莹', '刘艳霞', '刘学满', '钟顺乐', '徐履云', '熊金华', '黄欣', '宋祺', '黄召帆', '潘祥波', '崔红红'],
    'HR': ['吴杰',],
}

DICT_POSITION = {
    'SMANAGER': ['吴杰',],
    'COMMANDER': ['王美云', '夏甜', '姜宛英', '朱静', '王艳花', '董翠', '古哲浩', '吴洋', '邱梦雪', '祝鹏'],
    'TPLEADER': ['张汭', '蒋秋', '李四芬', '侯小雷', '汪静', '王青云', '冯振南', '廖露', '陈静', '魏星', '孙敏慧', '王林霞', '魏熙', '何汝梦'],
    'TPAE': [
        '朱林海', '翟梦', '李若雪', '李冬', '张颖', '王青', '付玉花', '洪鹏',
        '胡弯弯', '孙怡', '蒋雨娜', '王杰', '李雪琴', '薛尧', '周萍萍', '严娇', '陈晓云', '卢武',
        '刘俊', '孙丽', '董珊', '高云', '殷葵', '商程澄', '朱慧', '邱晓凤', '舒惠惠',
        '叶子凌', '明道远', '王萍', '毕佳男', '张文', '魏星', '舒容霞', '董涛', '贺丽明', '李迪佳',
        '董越月', '万慧', '邓淑婉', '高可月', '潘婷', '陈绪东', '向卉', '何玉玲',
        '胡佳丽', '郭强', '马丽思', '张紫兰', '乐微', '郭俊良', '田傲', '高颖', '刘影', '刘彩霞',
        '肖凯',
    ],
    'CONSULT': [
        '向宇', '邓雨晴', '熊钰馨', '张爽', '胡丽萍', '桂维维', '张道远', '袁江', '冀凌姣', '毛凌', '欧阳华宇',
        '邱梦婷', '万明', '王玥', '王磊', '黄卓', '尚文蔚', '谢敏', '戈乐', '姚远', '曹敏', '鄢文豪',
        '杨益明', '王昆', '李有为', '周婉瑶', '朱少杰', '陈心怡', '杨若梅', '张聪', '王洋', '沈超', '李文杰', '郑慧敏'
    ],
    'SHOPMANAGER': ['王秋石', '胡谦', '吴诗龙'],
    'SHOPASSISTANT': ['胡瑜', '杨芳', '叶星', '胡慧', '宋青'],
    'SEO': ['樊东虎', '李养旭', '刘千雨', '刘颖', '王栋'],
    'DESIGNER': ['吕雅雅', '王亚琴', '邵蓓', '王玲', '秦娇', '李秋丽', '陈忠', '许晓莹', '刘艳霞', '刘学满', '钟顺乐', '徐履云', '熊金华', '黄欣', '宋祺', '黄召帆', '潘祥波', '崔红红'],
}

DICT_PERMS = {
    'SMANAGER': '012aABCEF',
    'COMMANDER': '01',
    'TPLEADER': '01',
    'TPAE': '0',
    'CONSULT': '0',
    'SHOPMANAGER': '0',
    'SHOPASSISTANT': '0',
    'SEO': '0',
    'DESIGNER': '0',
}

DICT_MYCUST = {
    '邱梦婷': ['凡依品', '刘胖手机配件', 'youarebaby母婴旗舰店', '沃鸿车品专营店', '漫妮菲', '章鱼的夏天', '迪顿旗舰店', '东山再起_ying', '永信天下', 'yf点点家纺', 'ergobaby企业店', '衣之优品工厂店', '魅力妞妞21', 'renjianwei2005', '佳佳品牌小屋', 'tb0428137_2011', '下一站幸福10086', 'xiaoyaoyoulu', 'cassia_wang_', 'yyh750430', '美登家居专营店', 'bailutong', '枫叶红运动专营店', '百年福家居健康', 'yjy100861', 'yihegoldc', 'midea美的太平洋专卖店', '惠普鑫强利达专卖店', '创奇yingzi', 'liangzuohan'],
    '万明': ['jinnuo2408', '甄爱家园', '咕叽哈拉', 'chartres旗舰店', 'aliceyyy', '天姿添彩家居旗舰店', '大宝悦宁专卖店', '乐乐shmily1107', '麦思蓝旗舰店', 'smilezoe88', '晨萱屋舍', '轩雨华都鞋类专营店', '拾光家居馆', 'tt签alex', '加印上品内衣旗舰店', 'lizhanshen8899', '贝姆比旗舰店', 'dndn3c', '3木目心3', '左手旁边你的右手', '聚琪旗舰店', 'gs545259', '不凡工具', 'vip3f782da4', '绿草园图书专营店', '冰心武', '小谭1681', '朵茹服饰旗舰店', 'dndn旗舰店', '唯美丨时尚家居'],
    '王玥': ['立即送电子商务', '唐装旗袍专卖', '依佰妮88', '阿四韩东', '淘鞋潮品', '茵米恋旗舰店', '红鑫源家居', '7月21日晴', '蓝蝶运动户外旗舰店', '青于蓝风口有限公司', '居家绿洲园艺', '02shop', '卓古贸易6688', '卡帝乐鳄鱼中福发专卖店', 'shentuhuia', '狄克狮丹旗舰店', '奥比岛旗舰店', '晨宇天际图书专营店', '荣事达金泉专卖店', '服务至上_tb', '金牌卖家_时兴灯饰', '集雅旗舰店', '绿兔家居专营店', 'laypoo皖锦专卖店', '蘑菇堡旗舰店', '千江会母婴专营店', '优勤家居旗舰店', '中国范er630', '美宁汽配商城', '自由乐购馆'],
    '王磊': ['丁付祥', '迪卡梦玩具专营店', '怪食尚旗舰店', '南京林怡电子商贸有限公司', '南极人魅熙专卖店', 'shenruofei1', 'misfit旗舰店', '悍途户外直销店', 'boyi旗舰店', 'annie_oo', '月和家思旗舰店', '晓梅8w', '悦来香旗舰店', '中山市神光灯饰', '诚之信0880', 'rock洛克能久专卖店', 'aussino澳西奴澳尔克专卖', '克利图书专营店', '手牵手鞋铺', '绅麦旗舰店', 'xiangni0217', '安贝奇连锁', '义乌市青恩家居有限公司', '蝶恋心服饰', '靓呔呔旗舰店', '柏叶邦窗饰店', '戚夫人范范', '宝立食品专营店', '八百路旗舰店', '金龙鞋堂'],
    '黄卓': ['波雅·汉库克·书', 'yangguangeasy', 'rockmv_2008', 'wangwang19820402', 'btflin', '小飞象酒类专营店', 'wuzhoulongjm', '斯蒂芬罗奇旗舰店', 'liguohui5050', '萃铭珠宝旗舰店', '斯蒂芬罗奇旗舰店', 'yzf_888', '啊婕鲁旗舰店', '纳份爱收纳制品', '1987给予1990', '艾尚怡阁', 'seshine', '会飞的史努比wh270', '淘气优优女童潮品', '凯盛家居专营店', '惠百特电器专营店', '骉腾家纺', 'huangjiatao110', '巴利宝旗舰店', '灰太狼羊羊童装', '奇妙的枕头', '溢派车品旗舰店', 'a15920402096', '尚轩居家具世家', '远存家居专营店'],
    '尚文蔚': ['小天鹅鑫客专卖店', 'midea美的鑫客专卖店', '重庆汽车音响', 'ldl462274112', '厦门早龙食品', '民以食为天176563', '相约2008吧', 'heniny', '80后496162907', 'wulongde', '岑岑精品店', '喜来多实木家居', 'macro万家乐歌学专卖店', '雨若777', '王庆奎孙宁宁', '龙在飞电器专营店', '鸿盛旺财', 'wuzhoulongjm', '丽洁工贸有限公司', '皇家易购1', 'iusea', '琳77600', '迈克乔家居专营店', '德格户外专营店', 'weitol旗舰店', '会跳舞滴龙', '熊猫烧香1987', 'cl1148076942', '422638317姜', '911宇宇'],
    '谢敏': ['tx1191757981', '他淘你喜欢', '恩笛旗舰店', '博骏童装专营店', '弘腾昌户外专营店', '汐蝶旗舰店', 'notrepent1112', 'panyixuan26013', 'db19830805', 'ling小狠', '艳阳包装', '德力西毅德专卖店', '金汇商行', '爽客旗舰店', 'wangpanlin0124', '果呼吸水果旗舰店', '为了梦想奋斗2015', '心愉购物', '成功无限图书专营店', '龚进华88', '阿瑞斯运动户外专营', '艾薇姿', 'jindazhou', 'lovabledog新线专卖', '新线宠物用品专营店', '沃尔骑行装备', 'qfhil旗舰店', '宜友家美瑞旗舰店', 'zys_wz', 'zhuchaofan'],
    '戈乐': ['木木山上', '南i夕寒笙', '吴友平51', 'anta安踏翔润专卖店', 'ralflmx', '天源不锈钢168', 'dahuamaomm', 'kangqiaozhisan', 'kyb19868890', '摩尔城堡旗舰店', '虎牌涵美专卖店', '香思儿旗舰店', '上帝画不出直线', '华晓数码专营店', '澳柏顿旗航商城', '焕容堂旗舰店', '泡泡熊母婴用品', 'hyqhyzzy1688', 'aomas澳玛仕舒爵专卖店', 'zhuu1998', 'tb633226_22', '法莱奇', '博凯伦鞋业', '方圆家纺企业店', '海燕电子音像出版社旗舰店', 'heheman旗舰店', '瑞士邦顿', '10岁千与千寻', '邵颖钧', '深圳创点视觉租车专营店'],
    '姚远': ['上官昭君', '翼虎鞋类专营店', '恒逸我心', '大龙家居', 'boaqian', 'hongymy', '创仕顿旗舰店', '卜雅运动户外旗舰店', '韩符旗舰店', '梦其想服饰', 'yzj7108888', '香飘飘松木家居888', 'cici11821562', '找到青苔', '泰克莱斯户外专营店', '赵远宗', '良测家居专营店', '魔法小娇子', 'sisi7180', '新科乐玺专卖店', 'wj1802', '鸿瑞数码专营店', '成都鼎泰信', '沃霆眼镜专营店', '兰芝护理', '夜夜夜不完', '凌翩潇洛1', 'ashley19880721', '创仕顿旗舰店', 'xinglee518184'],
    '曹敏': ['莫纳丽达旗舰店', '依源色旗舰店', '菲菲小牛牛', '盛江汽配', 'sammi定制', '蚌埠捷诚数码专营店', '杰丽斯旗舰店', 'yousoku旗舰店', '米曲旗舰店', '锁盗中人', '圣大保罗鞋类旗舰店', '大儒图书专营店', '油豆天子', '登科母婴专营店', 'didi19841223', '莫纳丽达旗舰店', 'yaoxiaogu5006', '波呦vip', '欢馨屋', '徐家客店', 'midea美的中佳专卖店', 'shangmai尚迈旗舰店', 'tb2388153_2011', 'crow1007', '番茄1232012', 'hmin1122', 'qingtianlvluo', '玉领珠宝旗舰店', '饰屋旗舰店', '晋亿鞋类专营店'],
    '鄢文豪': ['花草香情旗舰店', 'nikezc', '皮尔芙旗舰店', '超拓鞋类专营店', 'miccidan玩具旗舰店', 'eluan易路安', 'hesong1021', '谷粟记食品', '倾心张婉瑜', 'zcl7310888', 'mimi_wen87', 'papa丢丢', '天晴369869', '腾氏车品专营店', '7766209陈祥飞', '京译达雅旗舰店', '第7铺旗舰店', 'wen8800438', 'missbaicc', 'z8226310532', '空城旧梦新人凌', '善己旗舰店', '模利玩具专营店', '佳旺花卉园', '粮城美景旗舰店', '龙星户外专营店', '来适家居专营店', 'panyixuan26013', '吉娅模特道具', '公牛森上专卖店'],
    '向宇': ['再续3267', '袋袋酷旗舰店', 'ccxyz', 'mimiqiko', '晗晗童装服饰', '爱尚依服饰有限公司', 'ebcastle旺紫专卖店', '安妮的_小熊', '西西小可童装', '爱普罗斯旺', '巴拉兔旗舰店', '淘淘牛7309', '鑫富升豪', 'mr_chenvogue', '蕊嘉童装专营店', '加油宝贝1011', '萌宠母婴旗舰店', 'guestar旗舰店', '淡淡de味道99', 'zzrr888', '爱尚公主童装', '橡木桶先生', '芊萌89001', '姆姆噜童装', '黑夜中的烟星', '超实惠便利店', 'wcx24006433', '小卡可童装旗舰店', '同学鞋业有限公司', '玲玲朵朵颖颖'],
    '邓雨晴': ['立欧娜真皮直销店', '我心从容123', 'sherony旗舰店', '广州市尚进广告', '博索电子', '偶遇私家', 'zhaoyingzi520', '创跃数码专营店', '童车世界0730', '忸岵垆如钥', '浩源数码专营店', '强生婴儿悦宁专卖店', '湖北晨迪公司', '爱艺坊ayf', '啊汕1506405705', '丽红2009', 'voki俞', 'beyond超越全球', '三狮电子', '川虎夜狼9', '万能青年服饰旗舰店', '红与蓝17', '奥迪电器', '都市手韵工厂店', '胡总110', '东晟酒类专营店', '大森林家居旗舰店', 'leonji915', '冬爱旗舰店', 'sstgtkmjl'],
    '熊钰馨': ['纪卓彤纪卓彤', '足之岛旗舰店', '看看你笑了', 'knightboy126', '2009从头越', '至尊工具', '酷卡乐旗舰店', '名匠家居网', 'lengye旗舰店', '简约卫浴2013', '农村人创业梦之店', '芭德士漆', '澳得利3d', '笑笑_良品', '康威母婴旗舰店', 'ds68688', '纪卓彤纪卓彤', 'sally1987124', 'srcydf', '蜘蛛精plus', '皇家花园1号', '黛维希旗舰店', '乐购园艺中心', '天一杏林图书专营店', 'eldon2', '中茶茗品家居专营店', '泽恩直销', '汉客旗舰店', '泡泡猪毛绒玩具店', '幽谷居客'],
    '张爽': ['蜉蝣公爵旗舰店', 'xie快乐卖', 'lijunandleo', '广东园林机械', '龙年商店', 'yunxianchen000', '杭州三桃实业有限公司', '威浩灯饰02', 'y徐美广', '棉花糖0606', '蜉蝣公爵旗舰店', '添赐汽车用品旗舰店', '竞美旗舰店', '一品涵图书专营店', '红叶叶98', 'q949831529', '少女_依橱', '奇彭家具', '冠鸿户外', 'lovabledog旗舰店', '肖剑13922155548', '益有厨柜旗舰店', '老陈制造', '徐辉美88', 'xwei_1987', 'jieyu0506', 'onebuye服饰旗舰店', '阿威托旗舰店', '韵美妈咪', 'lizhanming76'],
    '胡丽萍': ['浅笑嫣然0201', '梦幻天使zjr', '蒂嘉旗舰店', 'fanncytseng', 'ss生活馆', '文博仕旗舰店', '可妮萨旗舰店', '九叶绞股蓝茶', '厨斯达旗舰店', 'kitty猫m', '蓝米粒1977', 'long618825', 'povos奔腾博涵专卖店', '袁隆平食品旗舰店', 'sk555666', 'zj19872567', '纳美车饰', '尊贵不贵hj', '璎珞花缦菲', 'bundeadcat', 'tb115809_99', '本全科技', 'baoming周', 'orangegogo', '安康医疗直销', '纽科旗舰店', '逸邦全实木定制家具', 'allthetimeaiyyx', '飘飘园', '益童世嘉母婴专营店'],
    '桂维维': ['贝石旗舰店', '亚莱家居专营店', '柒小戚', '云飞轩', '京都真发', 'felicity1001', 'wang花样', '樱花烂漫旗舰店', '柒小戚', 'linglingas', '问津3079', 'diney', '丰尼贝尔旗舰店', '开奇家居专营店', '周洪妹x', 'bestlove最爱花店', 'balen888888', '三义商行', 'lustroly', 'xqh038124', '13530952457a', 'ytosize欧美服饰', '暮色家居生活', '风灵jillian', '纽思维尔家居旗舰店', 'angellove808', '裤子哥精品屋', '爱佳仕旗舰店', '奥习普旗舰店', '广州网赞贸易有限公司'],
    '张道远': ['岽堂禾旗舰店', '9doo旗舰店', 'floating1012822', 'w578旗舰店', 'xieshixf', '美式工艺时代', '卓尔布坊', '如果幸福deesa', 'eurokids旗舰店', '开心经营', '皇鹰箭旗舰店', 'zyz0455', '杭城晓霞6', '清清宝贝899', '九日山旗舰店', '廖氏家族lwx', 'forever5043', '希伯特旗舰店', 'hm2xn', '亿佳液晶之窗', 'kob旗舰店', '时代先锋烟具专营店', '流雪冰莹1', '芳心婷服饰', '苗苗红家居专营店', '审美空间生活馆', '长江渔具销售店', '超凡烟具旗舰店', '老四新衣', '罗琳首饰盒'],
    '袁江': ['洪大宠物用品专营店', '杭州炫裳服饰', 'kellvinnana', '迈瑞家居', '贵州良品店', '珈蓝渔具', 'dust617', '胖嘟嘟车饰', '小秋天的梦1204', '袁可会', 'ljy562427311', '乖乖小豆丁520', '萌小熊561', 'yxt984169', '飞楠剪业', 'zhuu1998', '必满意bemine', '维木家居', '希旺足', '要关爱父母健康', '我是莲莲00', '无限可能998', 'connie20140108', '姚小幺2013', '13530952457a', '杭润旗舰店', 'phjlz88', '水天谷', '陈石生', '盖莉旗舰店'],
    '冀凌姣': ['zhongda959', '子航服饰888', '广州久美', '祈愿居580', '美衣馆', 'tb3117433_2011', 'miker童工厂', '鄂尔多斯绒坤', '针诚制衣服装厂', '金银福禄寿', 'wuhuanran520', '富光文海专卖店', '大树妈妈母婴专营店', '瓷砖雕刻背景墙', 'bobby21cn', 'allayb', '一番好家居专营店', 'alex_one', 'wubibo_wbb', '泉州市品诺电子有限公司', '坤金科技', '365集美', '阿勇时尚店', 'maplezheng', '哈昵520', '依思q腾美专卖店', '百年佳选', '附庸风雅2009', 'tb552304609', '欣欣意动'],
    '毛凌': ['588鞋业', '大朗速码数码专营店', '硒部茶业', '拜斯特旗舰店', '云门汽车用品旗舰店', '小小木家', '世纪大明眼镜店', 'elvira惜年', '小白小红0211', 'qingyangwlh', '爱尚宠物用品专营店', '芊艺旗舰店', '宝力多旗舰店', 'wudongjiang88', '思雨caf', 'wxx5229', 'a284519235', 'b2723223', 'yangke0203sos', '肉趣旗舰店', 'anndears', 'zhenzhen1025', '四季商品城', '尚容旗舰店', '珈伊尚旗舰店', '园艺绿化苗木场', '欧贝萱旗舰店', '天下无竹旗舰店', '绿草青青户外', '蕴熙旗舰店'],
    '欧阳华宇': ['min15274868598', 'mgshow服饰', '美燕_mynest', '鲜味阁海洋食品', 'shoehomes', '双杰家居专营店', '13751847644婷', '百冠服饰专营店', '良帆软件专营店', '酥之派旗舰店', '蓝瓦348', '贝卡尔服饰专营店', '弗恒旗舰店', '玉菲梵旗舰店', '次元仓no1', '羊村衣舍旗舰店', '曼迪蜜莉旗舰店', '韩莉歌旗舰店', '玫瑰丛伊人', '酷钓户外专营店', '爱婴起航游戏毯', '席达旗舰店', 'yaowang5920', '水天谷', '唐寨山工艺厂', '良鑫居家日用工厂店', '优先牛仔', 'inidc', 'jasminenian', '橙意瓷砖连锁'],
    '王昆': ['信美儿', 'bayster', '岳聪涵逾', '七斤嫂酒类专营店', '沙米1618', '世纪酷站旗舰店', 'mwcoolbaby', '爱尚艺瓷', 'ggjlhz', 'chuanshijiafang', '欧菲雅工厂店', '爱美女人堂', '紫紫_dama', '格林娜箱包厂', '镜花水月19641021', 'lemonbao227', '爱乐轩63', 'zuoshengyou8', '云裳小铺1007', 'swzyz', '桐乡纯手工蚕丝被', '诚信经营198011', 'ggjlhz', '镜花水月19641021', '豪翔车业', '苹果vs花花', '谜颜旗舰店'],
    '李有为': ['勤学屋讲座', 'kynko坚固旗舰店', 'xunaonao', '爱的天使_2363'],
    '周婉瑶': ['科泰普旗舰店', '日照vs大众', '朱玉芝561', '真真真69', '浩瀚蓝海旗舰店'],
    '朱少杰': ['雅丽格旗舰店', '镇源饰品旗舰店', 'ligang2001xinongh', '绣色添香十字绣专营', '亿莎妮', '光脚爱上鞋', '施甜2013', '妮圣旗舰店', 'lz时尚女鞋', '爱不舍手礼品店', '絮派旗舰店', '隆喜源宠物用品专营店', 'iviivi旗舰店', '南屏耸翠', 'lumeishan8', '金华特色小屋', 't鲨鱼', 'jeffezheng', '互信诚比诚', '林格贝尔旗舰店', '恩师苑教育专营店', '我的泽宝520'],
    '陈心怡': ['帅到被人砍024', '凡踏尚品', '茂仓母婴专营店', '古玛卫浴旗舰店', '常熟昊艺', '浙江沃玛科技有限公司', 'demei886', '欣怡围巾帽子', '江苏姑苏窗轨制品厂', '花汐坊123', 'syhdney', '艺琳精品阁', 'e乐购电器商城', '欧麦好信誉五金灯饰', 'matteoke', '汉莱车品专营店', '唐卓旗舰店', '星艺标识', '文鸿商贸', 'dreamplacetostart', '冯焱1989', 'smotoyland', '好搭档母婴旗舰店', '宇艺格尔旗舰店', '大趾王成都专卖店', '恩森箱包小店', '爱你到呕死', '晨雨百货5', '加雷斯波茨旗舰店', '纹绣色料厂家'],
    '杨若梅': ['孤独的渔人', '德道贸易1988', '施寇美品牌内衣特卖店', '诗润姿家纺旗舰店', '德道贸易1988', '丽人居酒店用品一站式采购', 'lizhanming76', 'hejiaping1234', 'jiangrongliu', '千色衣铺', '莫良武9', '韩美潮流服饰1', '天福星星', 'tb98523475'],
    '张聪': ['百事吉车品专营店', '嫔悦旗舰店', '恒逸我心', 'ytcazj520', 'magu123456', 'tb6606005', '可尼诗卫浴', 'chy5388'],
    '王洋': ['黄玉13148', '韩轩庄孖典', '隐秘情节', '聚腾母婴专营店'],
    '沈超': ['tb83597131', 'hh380264', '立达人旗舰店', '迷你饰品mn', '鹏鹏32685548', '勋强车品专营店', '宝力多旗舰店'],
    '李文杰': ['青木尚瓷', '胜利旗舰店', '视崛影视广告', '福建玛雅广告', '信元千', 'wangdan19935', 'invxie旗舰店', '孪生店1991', '小熊贝特家居', '翱凝办公采购服务', '蔡建宇888', '乌伤少爷', '阿灿商城', '洁雅办公家居', 'bonven旗舰店', '三千里臻果系列', '公牛仪乐专卖店', 'nikezc', '水月温馨', '艺针衣秀服饰旗舰店', '涵子and小苹果', 'leolily旗舰店', '绮美思旗舰店', '灵动美心家居店', '倩狐皮具', '安翠时尚工坊', 'gof小神', '永不言弃6662011']
}


def init_psuser():
    print 'init_psuser department'
    for dept, user_list in DICT_DEPT.items():
        PSUser.objects.filter(name_cn__in=user_list).update(department=dept, cycle_load=0)
    print 'init_psuser position'
    for position, user_list in DICT_POSITION.items():
        PSUser.objects.filter(name_cn__in=user_list).update(position=position)
    print 'init_psuser permission'
    for position, perms in DICT_PERMS.items():
        PSUser.objects.filter(position=position).update(perms=perms)
    print 'init_psuser end'


def init_customer():
    print 'init_customer begin'
    Customer.objects.all().update(temp_flag=0)
    for name_cn, cust_list in DICT_MYCUST.items():
        print 'psuser', name_cn
        try:
            psuser = PSUser.objects.get(name_cn=name_cn)
            cust_set = Customer.objects.filter(nick__in=cust_list)
            shop_id_list = [cust.shop_id for cust in cust_set]
            print 'shop_id_count %s/%s' % (len(shop_id_list), len(cust_list))
            cust_set.update(temp_flag=psuser.id, consult=psuser)
            Subscribe.objects.filter(shop_id__in=shop_id_list, end_date__gt=datetime.date.today()).update(consult=psuser)
            ClientGroup.objects.filter(create_user=psuser, group_type=1).update(id_list=shop_id_list)
            ClientGroup.objects.filter(create_user=psuser, group_type=2).update(id_list='')
        except Exception, e:
            log.error('init_client_group error, psuser=%s, e=%s'%(name_cn, e))
    print 'init_customer end'


def init_tp_subscribe_consult():
    print 'init_tp_subscribe_consult begin'
    psuser = PSUser.objects.get(name_cn='技术部')
    Subscribe.objects.filter(end_date__gt=datetime.date.today()).exclude(category__in=('kcjl', 'qn', 'other', 'zttk', 'ztbd')).update(consult=psuser)
    PSUser.refresh_now_load()
    print 'init_tp_subscribe_consult end'
    

def init_customer_consult():
    shop_id_list = list(Subscribe.objects.filter(create_time__gte=datetime.datetime(2017, 2, 9)).values_list('shop_id', flat=True))
    Customer.get_or_create_servers(shop_id_list)


def main():
    init_psuser()
#     init_customer()
#     init_tp_subscribe_consult()
#     init_customer_consult()

if __name__ == "__main__":
    print 'begin'
    main()
    print 'end'
